pftbest/msp430_svd/msp430-gcc-support-files/include/msp430f47176.h
#define __MSP430_HAS_P7SEL__                  /* Define for DriverLib */
#define __MSP430_HAS_P8SEL__                  /* Define for DriverLib */
#define __MSP430_HAS_PASEL__                  /* Define for DriverLib */

sfr_b(P7IN);                                  /* Port 7 Input */
sfr_b(P7OUT);                                 /* Port 7 Output */
sfr_b(P7DIR);                                 /* Port 7 Direction */
sfr_b(P7SEL);                                 /* Port 7 Selection */
sfr_b(P7REN);                                 /* Port 7 Resistor Enable */

sfr_b(P8IN);                                  /* Port 8 Input */
sfr_b(P8OUT);                                 /* Port 8 Output */
sfr_b(P8DIR);                                 /* Port 8 Direction */
sfr_b(P8SEL);                                 /* Port 8 Selection */
sfr_b(P8REN);                                 /* Port 8 Resistor Enable */

sfr_w(PAIN);                                  /* Port A Input */
sfr_w(PAOUT);                                 /* Port A Output */
sfr_w(PADIR);                                 /* Port A Direction */
sfr_w(PASEL);                                 /* Port A Selection */
sfr_w(PAREN);                                 /* Port A Resistor Enable */

/************************************************************
* DIGITAL I/O Port9/10 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT9_R__                /* Definition to show that Module is available */
#define __MSP430_HAS_PORT10_R__                /* Definition to show that Module is available */
#define __MSP430_HAS_PORTB_R__                /* Definition to show that Module is available */

#define __MSP430_HAS_P9SEL__                  /* Define for DriverLib */
#define __MSP430_HAS_P10SEL__                 /* Define for DriverLib */
#define __MSP430_HAS_PBSEL__                  /* Define for DriverLib */

sfr_b(P9IN);                                  /* Port 9 Input */
sfr_b(P9OUT);                                 /* Port 9 Output */
sfr_b(P9DIR);                                 /* Port 9 Direction */
sfr_b(P9SEL);                                 /* Port 9 Selection */
sfr_b(P9REN);                                 /* Port 9 Resistor Enable */

sfr_b(P10IN);                                 /* Port 10 Input */
sfr_b(P10OUT);                                /* Port 10 Output */
sfr_b(P10DIR);                                /* Port 10 Direction */
sfr_b(P10SEL);                                /* Port 10 Selection */
sfr_b(P10REN);                                /* Port 10 Resistor Enable */

sfr_w(PBIN);                                  /* Port B Input */
sfr_w(PBOUT);                                 /* Port B Output */
sfr_w(PBDIR);                                 /* Port B Direction */
sfr_w(PBSEL);                                 /* Port B Selection */
sfr_w(PBREN);                                 /* Port B Resistor Enable */

/************************************************************
* Brown-Out, Supply Voltage Supervision (SVS)
************************************************************/
#define __MSP430_HAS_SVS__                    /* Definition to show that Module is available */

sfr_b(SVSCTL);                                /* SVS Control */
#define SVSFG                  (0x01)         /* SVS Flag */
#define SVSOP                  (0x02)         /* SVS output (read only) */
#define SVSON                  (0x04)         /* Switches the SVS on/off */
#define PORON                  (0x08)         /* Enable POR Generation if Low Voltage */
#define VLD0                   (0x10)
#define VLD1                   (0x20)
#define VLD2                   (0x40)
#define VLD3                   (0x80)

#define VLDON                  (0x10)
#define VLDOFF                 (0x00)
#define VLD_1_8V               (0x10)

/************************************************************
* SD16_A6 - Sigma Delta 16 Bit
************************************************************/
#define __MSP430_HAS_SD16_A6__                /* Definition to show that Module is available */

sfr_b(SD16INCTL0);                            /* SD16 Input Control Register Channel 0 */
sfr_b(SD16INCTL1);                            /* SD16 Input Control Register Channel 1 */
sfr_b(SD16INCTL2);                            /* SD16 Input Control Register Channel 2 */
sfr_b(SD16INCTL3);                            /* SD16 Input Control Register Channel 3 */
sfr_b(SD16INCTL4);                            /* SD16 Input Control Register Channel 4 */
sfr_b(SD16INCTL5);                            /* SD16 Input Control Register Channel 5 */
sfr_b(SD16PRE0);                              /* SD16 Preload Register Channel 0 */
sfr_b(SD16PRE1);                              /* SD16 Preload Register Channel 1 */
sfr_b(SD16PRE2);                              /* SD16 Preload Register Channel 2 */
sfr_b(SD16PRE3);                              /* SD16 Preload Register Channel 3 */
sfr_b(SD16PRE4);                              /* SD16 Preload Register Channel 4 */
sfr_b(SD16PRE5);                              /* SD16 Preload Register Channel 5 */
sfr_b(SD16CONF0);                             /* SD16 Internal Configuration Register 0 */
sfr_b(SD16CONF1);                             /* SD16 Internal Configuration Register 1 */
                                      /* Please use only the recommended settings */

sfr_w(SD16CTL);                               /* Sigma Delta ADC 16 Control Register */
sfr_w(SD16CCTL0);                             /* SD16 Channel 0 Control Register */
sfr_w(SD16CCTL1);                             /* SD16 Channel 1 Control Register */
sfr_w(SD16CCTL2);                             /* SD16 Channel 2 Control Register */
sfr_w(SD16CCTL3);                             /* SD16 Channel 3 Control Register */
sfr_w(SD16CCTL4);                             /* SD16 Channel 4 Control Register */
sfr_w(SD16CCTL5);                             /* SD16 Channel 5 Control Register */
sfr_w(SD16MEM0);                              /* SD16 Channel 0 Conversion Memory */
sfr_w(SD16MEM1);                              /* SD16 Channel 1 Conversion Memory */
sfr_w(SD16MEM2);                              /* SD16 Channel 2 Conversion Memory */
sfr_w(SD16MEM3);                              /* SD16 Channel 3 Conversion Memory */
sfr_w(SD16MEM4);                              /* SD16 Channel 4 Conversion Memory */
sfr_w(SD16MEM5);                              /* SD16 Channel 5 Conversion Memory */
sfr_w(SD16IV);                                /* SD16 Interrupt Vector Register */

/* SD16INCTLx */
#define SD16INCH0              (0x0001)       /* SD16 Input Channel select 0 */
#define SD16INCH1              (0x0002)       /* SD16 Input Channel select 1 */
#define SD16INCH2              (0x0004)       /* SD16 Input Channel select 2 */
#define SD16GAIN0              (0x0008)       /* SD16 Input Pre-Amplifier Gain Select 0 */
#define SD16GAIN1              (0x0010)       /* SD16 Input Pre-Amplifier Gain Select 1 */
#define SD16GAIN2              (0x0020)       /* SD16 Input Pre-Amplifier Gain Select 2 */
#define SD16INTDLY0            (0x0040)       /* SD16 Interrupt Delay after 1.Conversion 0 */
#define SD16INTDLY1            (0x0080)       /* SD16 Interrupt Delay after 1.Conversion 1 */

